# IFC_DMIsFieldEnabled

## Description
Checks if the indicated field, from current IFC Data Mapping, is enabled.

```pascal
FUNCTION IFC_DMIsFieldEnabled(
				inStrObjName   : STRING;
				inStrEntryName : STRING;
				inStrFieldName : STRING) : BOOLEAN;
```

```python

def vs.IFC_DMIsFieldEnabled(inStrObjName, inStrEntryName, inStrFieldName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inStrObjName|STRING||
|inStrEntryName|STRING||
|inStrFieldName|STRING||

## Version
Availability: from Vectorworks 2017
## Category
* IFC